{
  "sections": {
    "main": {
      "type": "article-template",
      "blocks": {
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Amidst the joyous festivities, the jingling of anklets not only spreads a feeling of auspiciousness, but it graciously intertwines tradition with high-end fashion. It stands for femininity, grace, social class, and love from the bestower. An anklet, also known as a \"payal\" or \"tolusu\" in some parts of our country, is an indispensable part of Indian bridal jewelry for both social and spiritual reasons.<\/p><p>A lot of households consider the jingling of an anklet as an unspoken sign for men to behave in a respectful way because a female member of the family is around. And for others, it gives them the joy of hearing a young girl run through the ancestral corridors, bathed in the adoration of her family members.<\/p><p>Irrespective of the reasons, the payal seems to hold irrefutable worth in Indian culture. And for a lot of women in current times, the first time they adorn an anklet is when they're shopping for their traditional Indian bridal jewelry. For brides, buying the perfect anklet can become a daunting task considering the plethora of options available at their disposal. In this blog, we will explore the value of anklets in terms of their role as a graceful addition to traditional Indian bridal jewelry, while also serving as a cherished symbol of marriage.<\/p><p><\/p>"
          }
        },
        "d24721ce-f537-4d06-9783-de88bfa789b4": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Bridal Jewelry: Encapsulating Heritage, Encompassing Richness<\/p>"
          }
        },
        "2ecc6904-98db-49dd-afb3-b69764829e68": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>As we embark on the magical journey of exploring the world of Indian bridal jewelry, history echoes the profound significance each adornment holds in the lives of women. Amongst them, the anklet, which is often not very visible to the outside world, holds a different value for every age group. For a married woman, it's a symbol of being tied in divine companionship with her soulmate. For a young maiden, it's symbolic of the grace and energy she radiates to the outside world. But anklets aren't novel to just Indian bridal jewelry or our society; instead, their existence dates back to the ancient civilizations of Mesopotamia and Egypt.<\/p>"
          }
        },
        "25d8d700-9ec9-4126-a00b-41cf572391f7": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/2_50b41baf-c3c3-4c9a-83d5-f683c8340ed0.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/2_50b41baf-c3c3-4c9a-83d5-f683c8340ed0.jpg",
            "smallinfotext": "<p><em>Anklet, Meroitic Period; A.D. 100–250. Image courtesy: The Met Museum<\/em><\/p>"
          }
        },
        "e64625cd-b163-4634-bf5f-ee83676a29f3": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Remarkably, some excavated anklets have withstood the test of time, their origins reaching as far back as 4000 BCE. Unlike their modern-day counterparts, they were pieced together by tying animal teeth or bones with a thread.<\/p><p>In ancient Egypt, anklets took on a radiant display of opulence, as women from privileged backgrounds donned gold or silver anklets, symbolizing their prosperity and affluence. Simultaneously, women of lower classes ingeniously fashioned anklets from wood or assembled them with a string and a precious gem, harnessing their spiritual essence to attract good fortune.<\/p><p>Today, anklets grace the ankles of women for a myriad of reasons, like to foster well-being, invite abundance, or simply the sheer delight of aesthetic expression.<\/p>"
          }
        }
      },
      "block_order": [
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2",
        "d24721ce-f537-4d06-9783-de88bfa789b4",
        "2ecc6904-98db-49dd-afb3-b69764829e68",
        "25d8d700-9ec9-4126-a00b-41cf572391f7",
        "e64625cd-b163-4634-bf5f-ee83676a29f3"
      ],
      "settings": {
        "image_hero": true,
        "blog_show_tags": false,
        "blog_show_date": true,
        "blog_show_comments": false,
        "blog_show_author": false,
        "social_sharing_blog": true
      }
    },
    "296f3653-d119-44ea-a190-7cc4b4096411": {
      "type": "article-images-with-texts-new",
      "blocks": {
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Rolling mill to achieve a length of thin ribbon",
            "infotext": "<p>Kundan is unmixed gold that is beaten in lengths to form a flat strip. The strips are rolled up around a small flat iron bar (10 cm long and 2.5 cm wide) and worked until each wire overlaps and joins the other after some preparation (heating, cooling, washing, and drying). The end result is pure gold foil, free of any alloying metal.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1": {
          "type": "information",
          "settings": {
            "image_on_left": true,
            "headingtext": "Kundan ribbons ready for use",
            "infotext": "<p>After folding multiple times, the Kundan ribbon (ranging in thickness from 4mm to 7mm) is ready to be divided into small pieces and used. It must be handled with extreme caution and must not be touched by hand to prevent impurities from mixing with the metal. According to goldsmiths, the ability to create high-quality Kundan is the first and most important virtue of their trade.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Different shapes put together",
            "infotext": "<p>The sophisticated Kundan technique enables gemstones of any size or shape to be set into intricate designs. Sometimes, before the entire stone-setting process begins, gold-smiths might fill the hollow frame, known as ghat, with different objects of varying shapes grouped together to form the object. Another option is to let the shape of the gemstone define the ghat's shame.<\/p><p>Since earlier times, certain shapes have influenced the jewelry-making tradition. Squares, triangles, and circles are the most common shapes.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2"
      ],
      "disabled": true,
      "settings": {
        "mainheadingtext": "The intricate art of kundan jewelry<br> making- a closer look!"
      }
    },
    "4c5e9829-38fd-4086-8e17-37ad69ad7a5a": {
      "type": "article-mp4-video-banner-new",
      "disabled": true,
      "settings": {
        "mp4videolink": "https:\/\/cdn.shopify.com\/videos\/c\/o\/v\/93c6d4ac069841abb2fbdf1099ed9f1f.mp4"
      }
    },
    "4af74115-0fc0-45bb-95b8-112a26212284": {
      "type": "article-image-texts-block-new",
      "blocks": {
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Anklets: The quintessential charm of traditional Indian bridal jewelry<\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/3_92ad11d2-14bc-43dd-96bb-52bef492eec9.png",
            "mainmobileimage": "shopify:\/\/shop_images\/3_92ad11d2-14bc-43dd-96bb-52bef492eec9.png",
            "smallinfotext": "<p><em>Image courtesy: Pinterest<\/em><\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>We're all privy to the timeless ritual of the Solah Sringaar, or sixteen adornments. It's a spectacle that exudes grace and feminine power. However, in the attempt to only appreciate how splendid it is to our eyes, we often fail to recognize the thoughts and research that went into establishing these rituals. <\/p><p>All of the elements used in this practice have been mindfully incorporated to accentuate a woman's well-being, social status, spiritual state, and future prospects. This also includes the anklet, a profound piece of traditional Indian bridal jewelry gracing the ankles of a woman.<\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-3": {
          "type": "texts",
          "disabled": true,
          "settings": {
            "fullinfotext": "<p>Joban (red—laal joban, green—hari joban, blue—neel joban) is a colored metallic foil used for colored stones such as ruby, emerald, and sapphire. Like the wax, the foil beneath the stone can also fade or lose color. Scholars use the color shift to determine the time period during which the jewelry piece could have been created.<\/p>"
          }
        },
        "c15e665d-71cd-421d-af2f-11482b68df4f": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/4_1af7ecd5-e69e-4fcf-b5ea-c8d659a9dfec.png",
            "mainmobileimage": "shopify:\/\/shop_images\/4_1af7ecd5-e69e-4fcf-b5ea-c8d659a9dfec.png",
            "smallinfotext": "<p><em>Image courtesy: Yami Gautam<\/em><\/p>"
          }
        },
        "7a956e0e-1795-4b30-906a-d0054e321c56": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>In <strong>Ayurveda<\/strong>, health is considered a balanced state of three doshas: Vata, Pitta, and Kapha. The energy is regulated through Nadis, and wearing an anklet (preferably silver) ensures that the energy stays grounded in the person. In various scriptures, it's mentioned that wearing silver and copper anklets also aids in fixing hormonal imbalances throughout the body. Additionally, anklets are believed to offer relief in the initial stages of sciatic nerve pain. By applying pressure to the legs, it also boosts circulation. <\/p><p>Among all metals, silver jewelry is one of the popular choices among Indian women. A widespread belief suggests that silver enhances immunity and improves blood circulation. Furthermore, it is also believed that wearing silver jewelry fosters a harmonious flow of energy and hormones throughout the body.<\/p><p>Incorporating practices that enhance a bride's beauty and well-being while aligning with Ayurveda and traditional customs is a common practice in many cultures. These beliefs are often passed down from one generation to the next. <\/p><p><\/p>"
          }
        },
        "21627c7d-c0c5-49fa-9fe4-89189fcff5ba": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Ghungroo: A Manifestation of Art & Allure<\/p>"
          }
        },
        "40c11d0b-acbf-4756-af3a-50e7f7280fa6": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/5_655ddd44-4824-41cd-a4ad-ebed09fb29b1.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/5_655ddd44-4824-41cd-a4ad-ebed09fb29b1.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "bee710da-cd08-4758-a086-e8305983402b": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p><strong>Ghungroos, Neura, Gejje, Silambu, Pagani, Paayat, Payal<\/strong>—these names symbolize the anklets cherished across the Indian subcontinent. Amidst varying names, one constant remains—their profound essence in the lives of those who wear them on their ankles.<\/p><p>In Sanskrit, adornments are called \"Bhooshanas,\" and ancient texts like Meghaduta mention the wish-fulfilling tree, Kalpavriksha, as the sole provider of ornaments requested by the goddesses. In those times, Payal was often referred to as padangada.<\/p><p>Among these anklets, ghungroos hold a special place. Found adorning the feet of Indian classical dancers, these anklets accompany the rhythmic melodies of the art form. There are four types of ghungroos, each carrying its own historical significance, also known as Noopuras in some parts of India.<\/p><p>Every ghungroo set worn by a dancer produces a specific symphony determined by the number of bells, the metallic composition, and the size of the bells. What sets these anklets apart is their ability to offer a unique and harmonious melody, enhancing the essence of bridal jewelry sets.<\/p><p>In traditional South Indian bridal jewelry, ghungroo anklets are often chosen by brides for their special day. When selecting such a set, it is advised to opt for smaller bells with fewer numbers or those that produce a pleasant yet subtle jingling sound with each step, adding an enchanting touch to every stride.<\/p><p><\/p>"
          }
        },
        "09abf0f8-2000-4897-9262-bbb52d622c49": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Ushering through Anklet Designs<\/p>"
          }
        },
        "6b4afc94-29a6-4049-a642-b5c5924ce20c": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/6_bdf17134-13e2-49fc-9e0d-223cccb68799.png",
            "mainmobileimage": "shopify:\/\/shop_images\/6_bdf17134-13e2-49fc-9e0d-223cccb68799.png",
            "smallinfotext": "<p><em>Image courtesy: Pinterest<\/em><\/p>"
          }
        },
        "7ac70ece-8d09-4378-926b-61f91a9332d0": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>In the world of traditional Indian bridal jewelry, we end up dealing with a dilemma of choices. Since there are so many ensembles to pick from, it's difficult to be 100% content with the choice you make. There's always a more exquisite lehenga, an even more mesmerizing necklace to layer it with, and an absolutely bewitching maangtika to adorn your heads with! But the endless circle sucks you in, and you forget what's truly important—finding the perfect pair that enhances your natural beauty yet keeps you comfortable!<\/p><p>So to aid you on this endless journey of picking the perfect anklet, we've curated a list of our favorite types of anklets for you! These would definitely capture your imagination and elevate your 'special day' ensemble to even newer heights. <\/p><p><\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-3",
        "c15e665d-71cd-421d-af2f-11482b68df4f",
        "7a956e0e-1795-4b30-906a-d0054e321c56",
        "21627c7d-c0c5-49fa-9fe4-89189fcff5ba",
        "40c11d0b-acbf-4756-af3a-50e7f7280fa6",
        "bee710da-cd08-4758-a086-e8305983402b",
        "09abf0f8-2000-4897-9262-bbb52d622c49",
        "6b4afc94-29a6-4049-a642-b5c5924ce20c",
        "7ac70ece-8d09-4378-926b-61f91a9332d0"
      ],
      "settings": {
      }
    },
    "0739307e-63b2-4110-be0d-d7b30435b6bb": {
      "type": "article-images-with-texts-new",
      "blocks": {
        "template--16770137260284__0739307e-63b2-4110-be0d-d7b30435b6bb-information-1": {
          "type": "information",
          "settings": {
            "image_on_left": true,
            "headingtext": "Kundan Anklets",
            "infotext": "<p>It is inherent in human nature to yearn for a look that leaves everyone in awe. And nothing captivates our attention quite like regal aesthetics. Crafted from gold and adorned with intricately carved precious and semi-precious stones in floral patterns, the kundan design epitomizes royalty.<\/p><p>The origin of Kundan jewelry can be traced back to a time when the craftsmanship techniques of the Mughals and Rajasthani Rajputs intertwined, giving birth to a unique art form. If you seek a majestic semblance with elaborate designs, then Kundan is the perfect choice for you.<br\/>The origin of Kundan jewelry can be traced back to a time when the craftsmanship techniques of the Mughals and Rajasthani Rajputs intertwined, giving birth to a unique art form. If you seek a majestic semblance with elaborate designs, then Kundan is the perfect choice for you.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/7_92988790-a80b-41a2-b032-cc3b34428a7a.png",
            "mobileimage": "shopify:\/\/shop_images\/7_92988790-a80b-41a2-b032-cc3b34428a7a.png",
            "imagetext": "<p><em>Image courtesy: Pinterest<\/em><\/p>"
          }
        },
        "template--16770137260284__0739307e-63b2-4110-be0d-d7b30435b6bb-information-2": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Meenakari Anklets",
            "infotext": "<p>These anklets possess designs that artfully weave tales through delicately carved patterns and enamored precious stones. Originating in the 16th century, Meenakari jewelry emerged when the Mughals introduced the art of enameling, seamlessly blending it with traditional techniques.<\/p><p>Crafted with sleek gold plates, polished to perfection, and adorned with a captivating array of stones, the world-famous Meenakari anklets offer a structured and captivating appearance. They are particularly favored by brides seeking a flamboyant style to complement their lehengas. And fortunately for them, the Indian bridal jewelry, especially the Meenakari collection, lives up to their lofty expectations. It adds a gilded and luxurious touch to the overall wedding look.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/8_fda60021-3fb2-4bc8-b480-e37e3bd8b363.png",
            "mobileimage": "shopify:\/\/shop_images\/8_fda60021-3fb2-4bc8-b480-e37e3bd8b363.png",
            "imagetext": "<p><em>Image courtesy: Pinterest<\/em><\/p>"
          }
        },
        "template--16770137260284__0739307e-63b2-4110-be0d-d7b30435b6bb-information-3": {
          "type": "information",
          "settings": {
            "image_on_left": true,
            "headingtext": "Pajeb",
            "infotext": "<p>Synonymous with the word “Punjab,” Pajeb is a prevalent anklet style among Punjabi brides. It creates an exquisitely voluminous impression by utilizing precious metals and stones. Often adorned with diamonds, silver Pajeb anklets also make a distinctive statement.<\/p><p>If, while assembling your final wedding look, you believe that an extraordinarily detailed yet abundant anklet piece is the missing element, a Pajeb can be the perfect complement for your special day.<\/p><p>As an anklet embraces your ankles, a captivating story unfolds—one infused with magnificence, charm, and the essence of femininity. And even though this piece of your entire traditional Indian bridal jewelry remains out of sight of the world, it elegantly completes your ensemble. The anklet serves as the final punctuation mark, effortlessly concluding your wedding look. <\/p>",
            "desktopimage": "shopify:\/\/shop_images\/9_98da121c-09d4-4dc5-aa9e-c614d08df52c.png",
            "mobileimage": "shopify:\/\/shop_images\/9_98da121c-09d4-4dc5-aa9e-c614d08df52c.png",
            "imagetext": "<p><em>Image courtesy: Pinterest<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "template--16770137260284__0739307e-63b2-4110-be0d-d7b30435b6bb-information-1",
        "template--16770137260284__0739307e-63b2-4110-be0d-d7b30435b6bb-information-2",
        "template--16770137260284__0739307e-63b2-4110-be0d-d7b30435b6bb-information-3"
      ],
      "settings": {
        "mainheadingtext": ""
      }
    },
    "cf816632-0986-49ce-822c-d8d0ab92f706": {
      "type": "article-banner-image-text-new",
      "disabled": true,
      "settings": {
        "maindesktopimage": "shopify:\/\/shop_images\/Rectangle_5945-min.jpg",
        "mainmobileimage": "shopify:\/\/shop_images\/Rectangle_6050-min.jpg",
        "imageinfotext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>",
        "maininfotext": "<p>Kundan jewelry has been a tradition for over centuries now and is still practiced today. It is clearly a testament to all the goldsmiths who have kept this traditional stone-setting technique alive on the Indian subcontinent.<\/p><p><strong>Brilliantly colored gemstones and addorsed tiger claws nestle together to form the strikingly shaped pendants of a nineteenth-century Indian necklace. The use of tiger claws as symbols of power and protection is an ancient motif in India, seen also in gold pendants from ninth-century Java and other regions of Asia. The technique of this necklace is that of Kundan, whereby stones are held in place by pure, pressed gold.<\/strong><\/p>"
      }
    },
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db": {
      "type": "article-latest-blog-posts-new",
      "settings": {
        "title": "Read more from our <span>journal<\/span>",
        "post_limit": 15,
        "blog_show_tags": false,
        "blog_show_date": false,
        "blog_show_comments": false,
        "blog_show_author": false,
        "blog_show_excerpt": true,
        "blog_image_size": "square"
      }
    },
    "522c486f-3c38-46df-9c27-be00415ecf72": {
      "type": "Index-featured-collection-new",
      "settings": {
        "backcolor": "#f6f2f1",
        "customClass": "blog_featured_collection_new",
        "title": "You may want to <span>shop<\/span>",
        "home_featured_products": "collectibles",
        "per_row": 4,
        "rows": 1,
        "mobile_scrollable": false,
        "view_all": true
      }
    },
    "1683210261162571d3": {
      "type": "apps",
      "settings": {
        "full_width": false,
        "space_around": true
      }
    }
  },
  "order": [
    "main",
    "296f3653-d119-44ea-a190-7cc4b4096411",
    "4c5e9829-38fd-4086-8e17-37ad69ad7a5a",
    "4af74115-0fc0-45bb-95b8-112a26212284",
    "0739307e-63b2-4110-be0d-d7b30435b6bb",
    "cf816632-0986-49ce-822c-d8d0ab92f706",
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db",
    "522c486f-3c38-46df-9c27-be00415ecf72",
    "1683210261162571d3"
  ]
}