{
  "sections": {
    "main": {
      "type": "article-template",
      "blocks": {
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>The glittering diamonds have gracefully weaved their way into the heart of Indian bridal jewelry amidst the allure and shimmer of gold. Diamonds have mesmerized the world with their beauty, rarity, and brilliance. In the world of gems, they stand proudly as a symbol of eternal love and enduring commitment, and in the grand tapestry of traditional and cultural symbolism, diamond Indian bridal jewelry emanates a luminous brilliance.<\/p><p>Blending themselves effortlessly in the mosaic of  Indian bridal jewelry, offering an array of pieces that capture the essence of the occasion. From the intricate chokers to the delicate mangtikkas, diamonds have etched their way into every facet of Indian bridal jewelry, but it's the diamond earrings that stand out.<\/p><p>Often reflected as a symbol of elegance and luxury, diamond earrings effortlessly blend contemporary designs and traditional craftsmanship. They shine as exquisite Indian bridal jewelry pieces that not only complement the attire but also enhance the beauty of the bride gracing her with a luxurious and sophisticated overall look.<\/p><p><\/p>"
          }
        },
        "heading_yUDhqD": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>The Timeless Appeal of Diamond Earrings<\/p>"
          }
        },
        "25d8d700-9ec9-4126-a00b-41cf572391f7": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/2_075f0f6b-7d64-45b0-bfcc-90bc47160b17.png",
            "mainmobileimage": "shopify:\/\/shop_images\/2_075f0f6b-7d64-45b0-bfcc-90bc47160b17.png",
            "smallinfotext": "<p><a href=\"https:\/\/www.aurusjewels.com\/products\/chandni-emerald-and-diamond-chandbaali-earrings\" target=\"_blank\" title=\"https:\/\/www.aurusjewels.com\/products\/chandni-emerald-and-diamond-chandbaali-earrings\"><span style=\"text-decoration:underline\"><em>Chandni Diamond Earrings<\/em><\/span><\/a><em> by Aurus<\/em><\/p>"
          }
        },
        "e64625cd-b163-4634-bf5f-ee83676a29f3": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Diamonds have endured as an emblem of love and prosperity throughout history. Their unyielding strength and dazzling brilliance mirror the qualities that are celebrated in a marriage. Diamonds are also believed to bring good fortune and blessings to the newlyweds, making them a cherished Indian bridal jewelry heirloom to pass down through generations. Their enduring charm makes them not only a dazzling accessory but also a tangible representation of commitment and affection.<\/p><p>Indian bridal jewelry is known for its aesthetic appeal, but what sets diamond earrings apart is their versatility. Apart from the ceremonial splendor of the wedding, these earrings find their place as enduring reminders of a joyous occasion. Diamond earrings are a few of those Indian bridal jewelry pieces that can be worn on various occasions, from the grandeur of wedding celebrations to the elegance of formal galas or even adding a touch of sophistication to everyday attire. <\/p><p>Worn in any way, this Indian bridal jewelry continues to exude radiance, becoming an integral part of the bride's post-wedding journey. Their ability to seamlessly transition from special occasions to everyday life makes them a treasured investment, celebrating not only the wedding but also the chapters that follow.  <\/p><p><\/p>"
          }
        },
        "heading_kHbhkA": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Evergreen Diamond Earrings for Indian Weddings<\/p>"
          }
        },
        "texts_QHAmW9": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>We understand that it can be a tough task to choose Indian bridal jewelry for your big day hence we have listed a few magnificent diamond earrings that will gracefully add sparkle to your ensemble also speaking volumes about your personality. Take a look.<\/p>"
          }
        },
        "heading_JXQHhR": {
          "type": "heading",
          "settings": {
            "headingtext": "<h2>Saanjh Earrings<\/h2>"
          }
        },
        "images_YfqbN3": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/3_af0920ae-06dd-4ff8-a327-664202f81fe1.png",
            "mainmobileimage": "shopify:\/\/shop_images\/3_af0920ae-06dd-4ff8-a327-664202f81fe1.png",
            "smallinfotext": "<p><a href=\"https:\/\/www.aurusjewels.com\/products\/saanjh-white-and-yellow-diamond-cocktail-earrings\/\" target=\"_blank\" title=\"https:\/\/www.aurusjewels.com\/products\/saanjh-white-and-yellow-diamond-cocktail-earrings\/\"><span style=\"text-decoration:underline\"><em>Saanjh Diamond Earrings<\/em><\/span><\/a><em> by Aurus<\/em><\/p>"
          }
        },
        "texts_9AKf6n": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Weddings are about letting your inner star shine, and Indian bridal jewelry is an invitation to bask in the limelight. The Saanjh earrings are like embracing a piece of art that's alive with shimmering lights. Crafted in radiant gold, this diamond earring is a harmonious fusion of elegance and charm. They are designed to make a bold entrance and steal the spotlight. <\/p><p>While the crescent moon-shaped stud delicately graces your earlobe, offering a touch of celestial allure, dangling gracefully beneath it, a resplendent raindrop-like pendant embellished with a mesmerizing array of diamonds, it mirrors the brilliance of a star-studded night sky.<\/p><p>Their unique design captures attention and sparkles with each movement, creating an air of intrigue around you. The blend of brilliant-cut and rose-cut diamonds gives these earrings a multifaceted allure, while the touch of green enamel adds a vibrant twist. A perfect choice to elevate your style quotient and make heads turn as you gracefully flaunt this remarkable Indian bridal jewelry that defines luxury and finesse.<\/p>"
          }
        },
        "heading_HwND76": {
          "type": "heading",
          "settings": {
            "headingtext": "<h2>Naina Pearl Earrings<\/h2>"
          }
        },
        "images_4WUAQr": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/4_e3094810-1cb0-43f2-9445-5f61da0b765c.png",
            "mainmobileimage": "shopify:\/\/shop_images\/4_e3094810-1cb0-43f2-9445-5f61da0b765c.png",
            "smallinfotext": "<p><a href=\"https:\/\/www.aurusjewels.com\/products\/naina-pearl-earrings\/\" target=\"_blank\" title=\"https:\/\/www.aurusjewels.com\/products\/naina-pearl-earrings\/\"><span style=\"text-decoration:underline\"><em>Naina Diamond and Pearl Earrings <\/em><\/span><\/a><em>by Aurus<\/em><\/p>"
          }
        },
        "texts_PGPhga": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Talking about the opulence of Indian bridal jewelry is incomplete without mentioning pearls. Naina pearl earrings are a fusion of artistry and luxury with an enchanting interplay of colors. Captivating blue tanzanite gemstones with a gold setting adorned with the brilliance of diamonds. The intricate red enamel and delicate pearl embellishments are like the finishing elements, all harmoniously coming together to create a masterpiece that adorns your ears.<\/p><p>Naina pearl earrings are more than just an accessory. This Indian bridal jewelry is a reflection of your exquisite taste and innate style. With an aura that radiates sophistication, Naina pearl earrings effortlessly transition from traditional to modern settings proving themselves to be the perfect companions for the moments you wish to cherish forever.<\/p>"
          }
        },
        "heading_gkz7zX": {
          "type": "heading",
          "settings": {
            "headingtext": "<h2>Naaz Earrings<\/h2>"
          }
        },
        "images_qGBUU7": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/5_bc798ff7-fa59-4c46-95b0-d336d7863ebd.png",
            "mainmobileimage": "shopify:\/\/shop_images\/5_bc798ff7-fa59-4c46-95b0-d336d7863ebd.png",
            "smallinfotext": "<p><a href=\"https:\/\/www.aurusjewels.com\/products\/naaz-diamond-and-gold-indian-earrings\/\" target=\"_blank\" title=\"https:\/\/www.aurusjewels.com\/products\/naaz-diamond-and-gold-indian-earrings\/\"><span style=\"text-decoration:underline\"><em>Naaz Diamond Earrings<\/em><\/span><\/a><em> by Aurus<\/em><\/p>"
          }
        },
        "texts_AQNdhR": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>A true embodiment of a mesmerizing blend of grace and sophistication, Naaz earrings is an Indian bridal jewelry that redefines elegance. Embracing a palette of subtle hues, making them a flawless choice for lovers of minimalism. A fusion of classic and modern, Naaz earrings are more than jewelry; they are a statement. <\/p><p>Meticulously handcrafted in resplendent 14K gold, these earrings are a testament to exquisite artistry. The heart of these earrings holds a captivating drop-shaped rose-cut diamond, emitting an ethereal glow that draws admiration. Encircling this centerpiece is an intricate dance of brilliant-cut diamonds, forming an ornate pattern that echoes tradition and sophistication, elevating the design to a level of unparalleled charm.<\/p>"
          }
        },
        "heading_ptxTzM": {
          "type": "heading",
          "settings": {
            "headingtext": "<h2>Niloufer Earrings<\/h2>"
          }
        },
        "images_Nergrn": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/6_516e3b84-fe82-4f9f-af3a-5dc81ddcb72d.png",
            "mainmobileimage": "shopify:\/\/shop_images\/6_516e3b84-fe82-4f9f-af3a-5dc81ddcb72d.png",
            "smallinfotext": "<p><a href=\"https:\/\/www.aurusjewels.com\/products\/niloufer-diamond-and-tourmaline-bridal-earrings\/\" target=\"_blank\" title=\"https:\/\/www.aurusjewels.com\/products\/niloufer-diamond-and-tourmaline-bridal-earrings\/\"><span style=\"text-decoration:underline\"><em>Niloufer Tourmaline and Diamond Earrings<\/em><\/span><\/a><em> by Aurus<\/em><\/p>"
          }
        },
        "texts_BfPJc4": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Radiate confidence and grace with Niloufer Earrings, a harmonious blend of subtlety and splendor, painting a picture of understated elegance. Crafted meticulously in 14K gold, these earrings boast a classic chandelier silhouette that effortlessly captures the essence of sophistication. <\/p><p>The true stars of this artistic Indian bridal jewelry masterpiece are the natural carved tourmaline gems, gracefully accentuated by pavé-set brilliant-cut diamonds. The rose-cut drops delicately sway, catching the light with every movement, and the oval-set tourmaline at the heart of the design adds a touch of regal charm. <\/p><p>This Indian bridal jewelry is a mesmerizing blend of timeless elegance and modern allure, a versatile addition to any collection.  Their allure knows no bounds, capturing hearts with their intricate design and captivating beauty.<\/p>"
          }
        },
        "heading_BiA9dP": {
          "type": "heading",
          "settings": {
            "headingtext": "<h2>Tara Earrings<\/h2>"
          }
        },
        "images_kLnDDA": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/7_0c130dbe-87df-40a7-b92c-2b97f86d447b.png",
            "mainmobileimage": "shopify:\/\/shop_images\/7_0c130dbe-87df-40a7-b92c-2b97f86d447b.png",
            "smallinfotext": "<p><a href=\"https:\/\/www.aurusjewels.com\/products\/tara-gold-and-diamond-jhumka-earrings\/\" target=\"_blank\" title=\"https:\/\/www.aurusjewels.com\/products\/tara-gold-and-diamond-jhumka-earrings\/\"><span style=\"text-decoration:underline\"><em>Tara Gold Pearl and Diamond Earrings<\/em><\/span><\/a><em> by Aurus<\/em><\/p>"
          }
        },
        "texts_V8CtKP": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Jhumka is an integral part of Indian bridal jewelry and Tara earrings effortlessly intertwine this classic design with a contemporary twist. This masterpiece effortlessly combines the timeless allure of diamonds with the soft luster of pearls, resulting in a pair of Jhumka earrings that exude sheer opulence. Crafted in gleaming gold, these earrings boast a delicate flower motif stud, providing a snug and comfortable fit against your earlobe.<\/p><p>The real showstopper of this Indian bridal jewelry design is the cascading layers of Jhumka, swaying gracefully with every step you take. The intricate craftsmanship and attention to detail are evident as these layers culminate in a delicate round pearl drop, adding a touch of sophistication to the overall design. These earrings are more than mere accessories; they are a testament to refined craftsmanship and refined taste. <\/p><p>Incorporating evergreen diamond earrings into your Indian bridal jewelry collection is not just about adorning yourself with exquisite jewels; it's about embracing timeless elegance that resonates with the rich traditions and modern allure of these special occasions. These sparkling gems are not mere accessories; they are statements of your style, grace, and everlasting love. Whether you're a bride, a bridesmaid, or a guest, let the radiance of evergreen diamond earrings illuminate not only your look but also the cherished memories you'll create on this joyous day.<\/p><p>As you exchange vows and celebrate in the vibrant tapestry of Indian wedding festivities, let your choice of earrings symbolize the enduring beauty of love, just like the diamonds that grace your ears – forever brilliant, forever cherished. <\/p>"
          }
        }
      },
      "block_order": [
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2",
        "heading_yUDhqD",
        "25d8d700-9ec9-4126-a00b-41cf572391f7",
        "e64625cd-b163-4634-bf5f-ee83676a29f3",
        "heading_kHbhkA",
        "texts_QHAmW9",
        "heading_JXQHhR",
        "images_YfqbN3",
        "texts_9AKf6n",
        "heading_HwND76",
        "images_4WUAQr",
        "texts_PGPhga",
        "heading_gkz7zX",
        "images_qGBUU7",
        "texts_AQNdhR",
        "heading_ptxTzM",
        "images_Nergrn",
        "texts_BfPJc4",
        "heading_BiA9dP",
        "images_kLnDDA",
        "texts_V8CtKP"
      ],
      "settings": {
        "image_hero": true,
        "blog_show_tags": false,
        "blog_show_date": true,
        "blog_show_comments": false,
        "blog_show_author": false,
        "social_sharing_blog": true
      }
    },
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db": {
      "type": "article-latest-blog-posts-new",
      "settings": {
        "title": "Read more from our <span>journal<\/span>",
        "post_limit": 15,
        "blog_show_tags": false,
        "blog_show_date": false,
        "blog_show_comments": false,
        "blog_show_author": false,
        "blog_show_excerpt": true,
        "blog_image_size": "square"
      }
    },
    "522c486f-3c38-46df-9c27-be00415ecf72": {
      "type": "Index-featured-collection-new",
      "settings": {
        "backcolor": "#f6f2f1",
        "customClass": "blog_featured_collection_new",
        "title": "You may want to <span>shop<\/span>",
        "home_featured_products": "collectibles",
        "per_row": 4,
        "rows": 1,
        "mobile_scrollable": false,
        "view_all": true
      }
    },
    "1683210261162571d3": {
      "type": "apps",
      "settings": {
        "full_width": false,
        "space_around": true
      }
    }
  },
  "order": [
    "main",
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db",
    "522c486f-3c38-46df-9c27-be00415ecf72",
    "1683210261162571d3"
  ]
}