{
  "sections": {
    "main": {
      "type": "article-template",
      "blocks": {
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Your wedding day is a momentous occasion, filled with anticipation, love, and joy. As the bride, all eyes will be on you, making it essential to look and feel your absolute best. Bridal styling plays a crucial role in creating the perfect look, reflecting your unique personality and style. However, there is a common misconception that achieving that dream bridal look requires an exorbitant budget. Fortunately, with the guidance and expertise of a skilled bridal stylist, you can effortlessly achieve your desired look without breaking the bank. Read along as we explore the art of bridal styling on a budget, discovering how a bridal stylist can transform your vision into reality while ensuring every penny is wisely spent.<\/p><p><\/p>"
          }
        },
        "be17b45c-7330-4e45-9512-1f30c9d362f1": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Setting a Realistic Budget<\/p>"
          }
        },
        "25d8d700-9ec9-4126-a00b-41cf572391f7": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/2_df595cf5-3212-4c94-b827-0610165a81bb.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/2_df595cf5-3212-4c94-b827-0610165a81bb.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "e64625cd-b163-4634-bf5f-ee83676a29f3": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When it comes to bridal styling, one of the first steps is to set a realistic budget. Establishing a budget in advance has numerous benefits, ensuring that you have a clear idea of your financial limitations and preventing any unexpected expenses from derailing your plans. However, it's crucial to remember that bridal styling is not just about the dress; it encompasses hair, makeup, accessories, and more. That's where a bridal stylist can be immensely helpful. <\/p><p>A skilled bridal stylist understands the intricacies of wedding fashion and can guide you in determining a reasonable and achievable budget. They can provide invaluable tips and advice on how to make the most of your budget and find affordable alternatives without compromising on your dream bridal look. With their expertise, you can confidently navigate the realm of bridal styling, knowing that you are making informed decisions and maximizing every dollar spent.<\/p>"
          }
        }
      },
      "block_order": [
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2",
        "be17b45c-7330-4e45-9512-1f30c9d362f1",
        "25d8d700-9ec9-4126-a00b-41cf572391f7",
        "e64625cd-b163-4634-bf5f-ee83676a29f3"
      ],
      "settings": {
        "image_hero": true,
        "blog_show_tags": false,
        "blog_show_date": true,
        "blog_show_comments": false,
        "blog_show_author": false,
        "social_sharing_blog": true
      }
    },
    "296f3653-d119-44ea-a190-7cc4b4096411": {
      "type": "article-images-with-texts-new",
      "blocks": {
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Rolling mill to achieve a length of thin ribbon",
            "infotext": "<p>Kundan is unmixed gold that is beaten in lengths to form a flat strip. The strips are rolled up around a small flat iron bar (10 cm long and 2.5 cm wide) and worked until each wire overlaps and joins the other after some preparation (heating, cooling, washing, and drying). The end result is pure gold foil, free of any alloying metal.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1": {
          "type": "information",
          "settings": {
            "image_on_left": true,
            "headingtext": "Kundan ribbons ready for use",
            "infotext": "<p>After folding multiple times, the Kundan ribbon (ranging in thickness from 4mm to 7mm) is ready to be divided into small pieces and used. It must be handled with extreme caution and must not be touched by hand to prevent impurities from mixing with the metal. According to goldsmiths, the ability to create high-quality Kundan is the first and most important virtue of their trade.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Different shapes put together",
            "infotext": "<p>The sophisticated Kundan technique enables gemstones of any size or shape to be set into intricate designs. Sometimes, before the entire stone-setting process begins, gold-smiths might fill the hollow frame, known as ghat, with different objects of varying shapes grouped together to form the object. Another option is to let the shape of the gemstone define the ghat's shame.<\/p><p>Since earlier times, certain shapes have influenced the jewelry-making tradition. Squares, triangles, and circles are the most common shapes.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2"
      ],
      "disabled": true,
      "settings": {
        "mainheadingtext": "The intricate art of kundan jewelry<br> making- a closer look!"
      }
    },
    "4c5e9829-38fd-4086-8e17-37ad69ad7a5a": {
      "type": "article-mp4-video-banner-new",
      "disabled": true,
      "settings": {
        "mp4videolink": "https:\/\/cdn.shopify.com\/videos\/c\/o\/v\/93c6d4ac069841abb2fbdf1099ed9f1f.mp4"
      }
    },
    "4af74115-0fc0-45bb-95b8-112a26212284": {
      "type": "article-image-texts-block-new",
      "blocks": {
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Prioritizing Key Elements<\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/3_8c5af01f-8015-43f9-b108-f1f3b33f319e.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/3_8c5af01f-8015-43f9-b108-f1f3b33f319e.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When working with a limited budget, it becomes even more crucial to make smart choices. Your bridal look is not just the attire but a thoughtful compilation of the attire, accessories, hair, and makeup, every detail matters. One of the significant advantages of working with a bridal stylist is their expertise in determining the importance of each element and how it contributes to the overall look. They understand that while every aspect is important, not all elements hold the same weight in terms of impact. By carefully considering your personal style and the desired aesthetic, they can help you decide which elements to prioritize based on their significance and your budget constraints.<\/p><p>A skilled bridal stylist can provide valuable guidance in determining the key elements to focus on. They can suggest cost-effective alternatives, recommend affordable yet stylish options, and even help you find hidden gems within your budget. By collaborating with a bridal stylist, you can achieve the perfect bridal look while making the most of your available resources, ensuring that your special day is both memorable and budget-friendly.<\/p><p><\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-3": {
          "type": "texts",
          "disabled": true,
          "settings": {
            "fullinfotext": "<p>Joban (red—laal joban, green—hari joban, blue—neel joban) is a colored metallic foil used for colored stones such as ruby, emerald, and sapphire. Like the wax, the foil beneath the stone can also fade or lose color. Scholars use the color shift to determine the time period during which the jewelry piece could have been created.<\/p>"
          }
        },
        "0ca66f19-14a8-4cd3-912a-65919e284d7c": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Maximizing Accessories within the Budget<\/p>"
          }
        },
        "c6302d12-0b66-43f2-a21f-139379a161db": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/4_f2bdf1b3-bd77-4aa3-91b2-072e293e1457.png",
            "mainmobileimage": "shopify:\/\/shop_images\/4_f2bdf1b3-bd77-4aa3-91b2-072e293e1457.png",
            "smallinfotext": "<p><em>Sampada Earrings by Aurus<\/em><\/p>"
          }
        },
        "3f034f37-b077-436b-94cb-dff33f1dcd8e": {
          "type": "images",
          "disabled": true,
          "settings": {
            "smallinfotext": "<p><em>Source and image courtesy: Victoria and Albert Museum<\/em><\/p>"
          }
        },
        "d9446696-a13c-4b67-8c2e-cee0710a84c0": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Accessories are a crucial element in enhancing your overall look, adding those final touches that make your ensemble shine.  From delicate earrings to statement necklaces, the right accessories can transform your appearance and add a touch of glamor to the ensemble. However, concerns about the associated costs often arise when it comes to selecting these essential pieces and a bridal stylist can assist you in this endeavor.<\/p><p>By harnessing the expertise of a bridal stylist, you can confidently maximize your accessories within your budget. They will work with you to create the perfect look that reflects your style and personality, all while being mindful of your financial constraints. With their assistance, you can achieve a stunning ensemble that showcases your individuality and makes you feel like the best version of yourself on your special day.<\/p><p>A capable bridal stylist not only recognizes the significance of accessories but also understands how to navigate within a limited budget to create a stunning look. They can provide you with invaluable suggestions for affordable options, such as exploring the possibility of borrowing accessories from family or friends who have previously tied the knot. This way, you can infuse sentimental value into your look while keeping expenses in check. <\/p><p>Another thing bridal stylists can help you with is to be strategic about your shopping. Stylists may recommend timing your purchases during sales and discounts, allowing you to snag great deals on accessories that would otherwise be out of reach. Additionally, they may introduce you to the world of handmade or vintage pieces, which can lend a unique charm to your ensemble at a fraction of the cost. Moreover, a talented bridal stylist guides you in selecting versatile accessories that can be repurposed for other occasions. This ensures that you get the most value for your money and extend the lifespan of your accessories beyond your wedding day. <\/p><p><\/p>"
          }
        },
        "7f1b6faa-2812-4154-93ec-89ffe22da20a": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Seeking Professional Guidance Within Budget<\/p>"
          }
        },
        "897654ad-d3af-4734-8b4f-56c0b64a39ca": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When it comes to achieving the perfect bridal look, many brides-to-be believe that hiring a bridal stylist is a luxury they simply cannot afford. However, it's important to recognize the value of consulting a bridal stylist, even on a limited budget. A skilled bridal stylist can offer invaluable guidance and expertise, helping you create a stunning look that complements your personality and wedding theme. A bridal stylist can bring a wealth of knowledge and creativity to the table. And fortunately, there are ways to find affordable bridal styling services that won't dig a hole in your pocket. <\/p><p>One option is to look for bridal stylists who offer consultation packages specifically designed for budget-conscious brides. These packages often provide a one-time session or a limited number of consultations, focusing on key aspects of your bridal styling needs. By opting for these packages, you can still benefit from the expertise of a professional fashion stylist without exceeding your budget.<\/p><p>Another approach is to seek recommendations from friends, family, or wedding planners for budget-friendly stylists. Word-of-mouth referrals can often lead you to talented stylists who are willing to work within your financial constraints. Don't hesitate to reach out to local bridal boutiques or wedding vendors to ask for suggestions as well. By expanding your network and exploring different options, you may discover hidden gems who are passionate about making brides feel beautiful on their special day without charging exorbitant fees.<\/p>"
          }
        },
        "4b5c74c5-efef-44f6-80e4-4bcecd1a7cd9": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/5_4270f2d2-4fd9-4029-b941-851bf7c86a5c.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/5_4270f2d2-4fd9-4029-b941-851bf7c86a5c.jpg",
            "smallinfotext": ""
          }
        },
        "87bcdc2a-8076-4919-8584-392df7360e95": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Remember, finding the perfect bridal stylist doesn't have to mean compromising your budget. With a little creativity and research, you can locate affordable styling services that will help you achieve the bridal look of your dreams. Embrace the expertise and guidance of a bridal stylist, and let them help you create a stunning and memorable look without breaking the bank.<\/p><p>Bridal styling on a budget is not only possible but also a smart way to approach your wedding preparations. Bridal stylists bring creativity to the table and help you with thoughtful planning to create a bridal style that reflects your personality and makes you feel beautiful on your special day, regardless of your budget. Remember, it's not the price tag that defines your beauty on your wedding day, but the confidence, joy, and love that radiate from within. Embrace your unique style, stay true to yourself, and make the most of the resources available to you. Happy styling!<\/p>"
          }
        },
        "35fb7cda-3f9b-442b-8102-e69df43769d4": {
          "type": "texts",
          "disabled": true,
          "settings": {
            "fullinfotext": "<p>Ornate designs made with precious gemstones encrusted in 24K gold—said to have been born in the royal region of Rajasthan and flourished during the era of the Mughals, Kundan jewelry is perhaps one of the most, if not the most-loved jewelry styles in India, especially that of brides.<\/p><p>According to Bernadette Van Gelder's book Traditional Indian Jewelry—Beautiful People, the Kundan jewelry-making technique is perhaps the oldest technique for setting stones in jewelry using gold in the Indian tradition. According to the book, this technique was first mentioned in the Ain-i-Akbari, the third and final book of Akbarnama, the official account of Akbar's reign.<\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-3",
        "0ca66f19-14a8-4cd3-912a-65919e284d7c",
        "c6302d12-0b66-43f2-a21f-139379a161db",
        "3f034f37-b077-436b-94cb-dff33f1dcd8e",
        "d9446696-a13c-4b67-8c2e-cee0710a84c0",
        "7f1b6faa-2812-4154-93ec-89ffe22da20a",
        "897654ad-d3af-4734-8b4f-56c0b64a39ca",
        "4b5c74c5-efef-44f6-80e4-4bcecd1a7cd9",
        "87bcdc2a-8076-4919-8584-392df7360e95",
        "35fb7cda-3f9b-442b-8102-e69df43769d4"
      ],
      "settings": {
      }
    },
    "98705503-a4cc-42ae-8594-b45067388ab5": {
      "type": "article-image-text-column-new",
      "blocks": {
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-0": {
          "type": "information",
          "settings": {
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6083_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6087-min.jpg",
            "title": "<p><em>Diamond being prepared with silver foil before setting<\/em><\/p>",
            "infotext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-1": {
          "type": "information",
          "settings": {
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6083_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6087-min.jpg",
            "title": "<p><em>Diamonds being set<\/em><\/p>",
            "infotext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-2": {
          "type": "information",
          "settings": {
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6083_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6087-min.jpg",
            "title": "<p><em>Gold Kundan strip being tooled around the diamond<\/em><\/p>",
            "infotext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-3": {
          "type": "information",
          "settings": {
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6083_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6087-min.jpg",
            "title": "<p><em>Finished Kundan-technique earrings with embellished pearls<\/em><\/p>",
            "infotext": "<p><em>Finished Kundan-technique earrings with embellished pearls<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-0",
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-1",
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-2",
        "template--16686221689084__98705503-a4cc-42ae-8594-b45067388ab5-1679556719b0c670b6-3"
      ],
      "disabled": true,
      "settings": {
      }
    },
    "cf816632-0986-49ce-822c-d8d0ab92f706": {
      "type": "article-banner-image-text-new",
      "disabled": true,
      "settings": {
        "maindesktopimage": "shopify:\/\/shop_images\/Rectangle_5945-min.jpg",
        "mainmobileimage": "shopify:\/\/shop_images\/Rectangle_6050-min.jpg",
        "imageinfotext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>",
        "maininfotext": "<p>Kundan jewelry has been a tradition for over centuries now and is still practiced today. It is clearly a testament to all the goldsmiths who have kept this traditional stone-setting technique alive on the Indian subcontinent.<\/p><p><strong>Brilliantly colored gemstones and addorsed tiger claws nestle together to form the strikingly shaped pendants of a nineteenth-century Indian necklace. The use of tiger claws as symbols of power and protection is an ancient motif in India, seen also in gold pendants from ninth-century Java and other regions of Asia. The technique of this necklace is that of Kundan, whereby stones are held in place by pure, pressed gold.<\/strong><\/p>"
      }
    },
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db": {
      "type": "article-latest-blog-posts-new",
      "settings": {
        "title": "Read more from our <span>journal<\/span>",
        "post_limit": 15,
        "blog_show_tags": false,
        "blog_show_date": false,
        "blog_show_comments": false,
        "blog_show_author": false,
        "blog_show_excerpt": true,
        "blog_image_size": "square"
      }
    },
    "522c486f-3c38-46df-9c27-be00415ecf72": {
      "type": "Index-featured-collection-new",
      "settings": {
        "backcolor": "#f6f2f1",
        "customClass": "blog_featured_collection_new",
        "title": "You may want to <span>shop<\/span>",
        "home_featured_products": "collectibles",
        "per_row": 4,
        "rows": 1,
        "mobile_scrollable": false,
        "view_all": true
      }
    },
    "1683210261162571d3": {
      "type": "apps",
      "settings": {
        "full_width": false,
        "space_around": true
      }
    }
  },
  "order": [
    "main",
    "296f3653-d119-44ea-a190-7cc4b4096411",
    "4c5e9829-38fd-4086-8e17-37ad69ad7a5a",
    "4af74115-0fc0-45bb-95b8-112a26212284",
    "98705503-a4cc-42ae-8594-b45067388ab5",
    "cf816632-0986-49ce-822c-d8d0ab92f706",
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db",
    "522c486f-3c38-46df-9c27-be00415ecf72",
    "1683210261162571d3"
  ]
}