{
  "sections": {
    "main": {
      "type": "article-template",
      "blocks": {
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>It's the day you've been waiting for—your wedding day. You've spent months preparing for it, from selecting the perfect outfit to practicing your dance moves for the sangeet. But there's one aspect of your bridal look that you just can't overlook: jewelry. Indian wedding jewelry is one of the crucial aspects contributing to the grandeur of the celebration. It is not just an accessory but an embodiment of the culture and traditions of the country. <\/p><p>However, the multitude of fascinating options for Indian wedding jewelry can leave you confused and overwhelmed. But with the right guidance, selecting the perfect pieces can be an enjoyable experience. So today, we will be taking you through everything you need to know about accessorizing for your big day.<\/p>"
          }
        },
        "25d8d700-9ec9-4126-a00b-41cf572391f7": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/pexels-spora-weddings-13162819.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/pexels-spora-weddings-13162819.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2",
        "25d8d700-9ec9-4126-a00b-41cf572391f7"
      ],
      "settings": {
        "backdesktopimage": "shopify:\/\/shop_images\/pexels-gursher-gill-136618451.jpg",
        "backmobileimage": "shopify:\/\/shop_images\/pexels-gursher-gill-136618451.jpg",
        "image_hero": true,
        "blog_show_tags": false,
        "blog_show_date": true,
        "blog_show_comments": false,
        "blog_show_author": false,
        "social_sharing_blog": true
      }
    },
    "4af74115-0fc0-45bb-95b8-112a26212284": {
      "type": "article-image-texts-block-new",
      "blocks": {
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Golden Rules to Select Indian Wedding Jewelry<\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Jewelry plays a significant role in your overall appearance for the big day. It is a treasure that you hold for a lifetime and is also often passed down from generation to generation. The right Indian wedding jewelry can enhance your look, accentuate your features, and complement your outfit, making you feel confident and beautiful on your special day. Hence, choosing your bridal jewelry thoughtfully is important. Here are a few points to consider before buying your Indian wedding jewelry:<\/p><h3>Start With The Outfit<\/h3>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/indian_wedding_outfit.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/indian_wedding_outfit.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-3": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>The outfit serves as the foundation for selecting the perfect Indian wedding jewelry. It is essential to keep in mind the style, color, embellishments, and <a href=\"https:\/\/www.aurusjewels.com\/blogs\/news\/right-necklace-design-for-your-neckline\" target=\"_blank\" title=\"https:\/\/www.aurusjewels.com\/blogs\/news\/right-necklace-design-for-your-neckline\">neckline of the outfit<\/a> while choosing the jewelry pieces. It's important to keep a balance between the outfit and the jewelry and ensure that they complement each other rather than clash. For instance, For heavily embellished outfits, it's best to opt for understated and elegant Indian wedding jewelry to avoid an overdone look. Simple and delicate jewelry can enhance the beauty of intricate designs and intricate embroidery on the outfit.<\/p><p><\/p>"
          }
        },
        "e5d56109-57df-46e4-a3aa-2789cb83f7b9": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<h3>Set a Budget<\/h3><p>Traditional Indian wedding jewelry is known for its intricate designs, high-quality materials, and craftsmanship, which can result in significant expenses. Hence, setting a budget is an important step in the selection process, as it can help you narrow down your options. Being realistic about your budget while researching can help you get a better idea of the market rate and make a well-informed decision!<\/p><p><\/p>"
          }
        },
        "ebe41597-b218-4620-8581-4ea0a35e9e9f": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<h3>Place Personal Style Before Trends<\/h3><p>While following trends can be tempting, it's important to remember that the bridal jewelry you choose will be a part of your memories for a lifetime, and hence, your personal style should guide your choices and take precedence over the current trends. Indian wedding jewelry offers a wide variety of options to choose from, including traditional pieces like Kundan, Polki, and Jadau or modern styles like diamond and gold jewelry. To create a timeless bridal look that's true to you, it's important to select pieces that align with your preferences and tastes.<\/p><h3>Don’t Forget About Hair and Make-up<\/h3>"
          }
        },
        "68a7bcec-5cb9-4fa4-b19e-f74be222d229": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/indian_wedding_hair_and_makeup.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/indian_wedding_hair_and_makeup.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "2bf223b9-b320-4d33-8433-2e7077860153": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>On your wedding day, you want to look your best from head to toe. And while Indian wedding jewelry plays a crucial role in enhancing your bridal look, it's equally essential not to overlook your hair and makeup. Your hair and makeup can make or break your overall look, so it's essential to give them the attention they deserve. Don't make the mistake of focusing solely on your jewelry and outfit and neglecting your hair and makeup. Your hairstyle and makeup should complement your Indian bridal jewelry and outfit and enhance your natural beauty. Therefore, it's crucial to plan your hair and makeup in advance and choose a style that suits your personality and enhances your features.<\/p><p><\/p>"
          }
        },
        "48233823-3d87-4258-b126-641d4bb6869b": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<h3>Less Is More<\/h3><p>When it comes to Indian wedding jewelry, it's easy to get carried away and want to wear everything that catches your eye. However, it's crucial to remember not to overdo it with your jewelry. Instead, focus on choosing a few statement pieces that will complement your outfit and enhance your overall look. For instance, if you're wearing a heavy necklace, you can pair it with simple earrings and skip the bangles. On the other hand, if you're wearing heavy earrings, you can opt for a simple necklace or bracelet. The key is to strike a balance and ensure that your Indian wedding jewelry doesn't overpower your outfit or make you uncomfortable.<\/p><h3>Coordinate With Your Partner<\/h3>"
          }
        },
        "0f793732-54f5-4127-a22d-c1637fcbc7bd": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/pexels-rupinder-korpal-13838717.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/pexels-rupinder-korpal-13838717.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "b7eae39c-b9a5-4ad2-92e7-5925b2962815": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>One important aspect that you may want to consider when selecting your Indian wedding jewelry is coordinating with your partner. It is always a good idea to match your bridal jewelry not only with your outfit but also your partner's attire to create a cohesive and harmonious look. For example, if your partner is wearing a gold sherwani, you can opt for gold jewelry with matching stones or colors. Or if your partner's outfit is heavily embellished, you may want to choose simpler jewelry to balance the overall look. Similarly, if you're wearing diamond jewelry, your partner can wear a diamond-studded brooch or tie pin. The idea here is to create a synchronized look that can enhance your overall appearance as a couple.<\/p><p><\/p>"
          }
        },
        "cc7ae5f1-0aa3-4a17-b945-e8086c5c786b": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<h3>Think Beyond the Big Day<\/h3><p>When selecting Indian wedding jewelry, it's essential to keep in mind the concept of re-wearability. While it's natural to want to go all out for your special day, it's also crucial to think about the future. Pieces that are too trendy or over-the-top may not be practical for everyday wear or future events. Therefore, it's crucial to consider rewearability when investing in Indian wedding jewelry. Jewelry pieces that are versatile and can be worn again will give you more bang for your buck. It is a wise decision to choose timeless and classic jewelry that can be worn on other occasions too.<\/p><h3>Try It On<\/h3>"
          }
        },
        "1d18a4e2-d95b-4a52-80b4-7a0fb720c7b5": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/pexels-jonathan-borba-5253100.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/pexels-jonathan-borba-5253100.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "cabeb367-419d-47ba-a968-3cd9d45e2067": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>While the wedding outfit is always bought after trying it on, jewelry is often neglected. Making sure Indian wedding jewelry looks good on you before the final purchase is crucial. Trying it on helps you see how it complements your outfit, skin tone, and personal style. Moreover, traditional Indian wedding jewelry is often heavy. Trying on the jewelry can also help you get an idea of how comfortable it is to wear and whether it's suitable for the duration of the event. Make sure you wear the complete bridal ensemble, including the outfit, shoes, and makeup, before selecting the jewelry. This will help you get a complete picture of your bridal look and make it easier to select the right pieces.<\/p><p><\/p>"
          }
        },
        "a4e1fe30-0333-40c2-a451-e9dbba77bcf3": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<h3>Avoid Last-Minute Rush<\/h3><p>Indian wedding jewelry is one of the most important parts of a bride's attire, and buying everything at the last minute can be a recipe for disaster. With so many options available, it can be easy to get carried away and purchase items that don't complement each other or your overall bridal look. Moreover, hasty shopping can lead to higher costs and limited options. Planning ahead of time will give you the opportunity to research, browse through options, and make informed decisions. It also allows you to get any necessary alterations or adjustments made, saving you from last-minute panic. So make a list of the pieces you need well in advance and start exploring your options early on.<\/p><p>The tips mentioned above can ensure that you make the right choices. Still, selecting Indian wedding jewelry can be a daunting task, and having an expert by your side to lend you a helping hand makes it all smooth. Looking for an expert? You know where to find us!<\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-3",
        "e5d56109-57df-46e4-a3aa-2789cb83f7b9",
        "ebe41597-b218-4620-8581-4ea0a35e9e9f",
        "68a7bcec-5cb9-4fa4-b19e-f74be222d229",
        "2bf223b9-b320-4d33-8433-2e7077860153",
        "48233823-3d87-4258-b126-641d4bb6869b",
        "0f793732-54f5-4127-a22d-c1637fcbc7bd",
        "b7eae39c-b9a5-4ad2-92e7-5925b2962815",
        "cc7ae5f1-0aa3-4a17-b945-e8086c5c786b",
        "1d18a4e2-d95b-4a52-80b4-7a0fb720c7b5",
        "cabeb367-419d-47ba-a968-3cd9d45e2067",
        "a4e1fe30-0333-40c2-a451-e9dbba77bcf3"
      ],
      "settings": {
      }
    },
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db": {
      "type": "article-latest-blog-posts-new",
      "settings": {
        "title": "Read more from our <span>journal<\/span>",
        "post_limit": 15,
        "blog_show_tags": false,
        "blog_show_date": false,
        "blog_show_comments": false,
        "blog_show_author": false,
        "blog_show_excerpt": true,
        "blog_image_size": "square"
      }
    },
    "522c486f-3c38-46df-9c27-be00415ecf72": {
      "type": "Index-featured-collection-new",
      "settings": {
        "backcolor": "#f6f2f1",
        "customClass": "blog_featured_collection_new",
        "title": "You may want to <span>shop<\/span>",
        "home_featured_products": "collectibles",
        "per_row": 4,
        "rows": 1,
        "mobile_scrollable": false,
        "view_all": true
      }
    },
    "1683210261162571d3": {
      "type": "apps",
      "blocks": {
        "3a09b2ef-849a-4b87-9534-e9cc65ede753": {
          "type": "shopify:\/\/apps\/time2read-read-time-estimator\/blocks\/app-block-article-read-time\/de876115-09d1-4e2f-bd5b-ce94430501cb",
          "settings": {
            "read_time_prefix": "",
            "read_time_suffix": "Minute",
            "read_time_text_color": "#000000",
            "read_time_top_padding": 0,
            "read_time_bottom_padding": 0,
            "read_time_font_size": 16,
            "read_time_bold": false,
            "horizontal_alignment": "unset",
            "read_time_placement": "after",
            "read_time_custom_selector": ".read_placement"
          }
        }
      },
      "block_order": [
        "3a09b2ef-849a-4b87-9534-e9cc65ede753"
      ],
      "settings": {
        "full_width": false,
        "space_around": true
      }
    }
  },
  "order": [
    "main",
    "4af74115-0fc0-45bb-95b8-112a26212284",
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db",
    "522c486f-3c38-46df-9c27-be00415ecf72",
    "1683210261162571d3"
  ]
}