{
  "sections": {
    "main": {
      "type": "article-template",
      "blocks": {
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Indian weddings are a sight to behold with their grandeur, traditional rituals, and stunning fashion. One of the most important aspects that play a significant role in adding to the beauty and elegance of the occasion is Indian wedding jewelry. And while the bride's stunning ensemble takes center stage, guests also showcase their fashion game at weddings. If you're the bride's best friend or a distant relative attending the festivities and looking for some Indian wedding jewelry, you've just come to the right place!<\/p>"
          }
        },
        "25d8d700-9ec9-4126-a00b-41cf572391f7": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/dollar-gill-oH-PNVWykUo-unsplash.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/dollar-gill-oH-PNVWykUo-unsplash.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2",
        "25d8d700-9ec9-4126-a00b-41cf572391f7"
      ],
      "settings": {
        "backdesktopimage": "shopify:\/\/shop_images\/Celebrity_inspired_indian_wedding_jewelry.png",
        "backmobileimage": "shopify:\/\/shop_images\/Celebrity_inspired_indian_wedding_jewelry.png",
        "image_hero": true,
        "blog_show_tags": false,
        "blog_show_date": true,
        "blog_show_comments": false,
        "blog_show_author": false,
        "social_sharing_blog": true
      }
    },
    "4af74115-0fc0-45bb-95b8-112a26212284": {
      "type": "article-image-texts-block-new",
      "blocks": {
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Accessorize Like a Star: Celebrity Guest Indian Wedding Jewelry Trends<\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When it comes to fashion, celebrities have been a source of inspiration for centuries. Their fashion influence is not just limited to shoots and red carpets; they are also at the forefront of wedding fashion as well. Whether it is their own wedding or they are attending it as guests, with their stunning choices making fashion statements, celebrities have been inspiring many Indian wedding jewelry trends that are taking over the internet by storm.<\/p><p>Today we will be laying down a few celebrity-inspired guest Indian wedding jewelry ideas for you to add some extra flair to your style. From elegant chokers to exquisite statement earrings, we've got you covered with all the jewelry inspiration you need to make a lasting impression at any wedding event. So, get ready to take notes and prepare to dazzle the crowd with your impeccable sense of style!<\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1"
      ],
      "settings": {
      }
    },
    "296f3653-d119-44ea-a190-7cc4b4096411": {
      "type": "article-images-with-texts-new",
      "blocks": {
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "One and Done: Sensation of a Statement Necklace",
            "infotext": "<p>A statement Indian necklace is one of the most versatile pieces of Indian wedding jewelry a woman can own. It has the power to transform any outfit into a show-stopping ensemble. From chokers and bib necklaces to long pendant necklaces and layered chains, there's a style to suit every taste. The beauty of a statement necklace lies in its ability to enhance the overall look without overpowering it. This is especially true when it comes to traditional Indian wear, where the right piece of jewelry can make all the difference.<\/p><p>Kareena Kapoor Khan has shown us how a statement piece of Indian wedding jewelry—a necklace—can be the perfect accessory for a wedding guest's look. By opting for just one key piece of jewelry to pair with a traditional outfit, the lehenga, she allowed the necklace to take center stage and become the highlight of her outfit. She went with a unique choker necklace with a traditional enamel work—Meenakari—that caught everyone's attention. Along with Meenakari work the choker was beautifully decorated with Kundan making it a perfect traditional Indian wedding jewelry.<\/p><p>The choker was further accentuated with the use of pearls and beads. The pearls added a soft and delicate touch to the overall design, while beads gave the necklace a playful and fun look while adding a bit of movement to the design. A statement necklace transformed her outfit into a stunning ensemble, giving it a touch of glamor and sophistication. <\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Kareena_Kapoor_Statement_Necklace.png",
            "mobileimage": "shopify:\/\/shop_images\/Kareena_Kapoor_Statement_Necklace.png",
            "imagetext": "<p><em>Image courtesy: Instagram<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1": {
          "type": "information",
          "settings": {
            "image_on_left": true,
            "headingtext": "Crowning Glory: Story of a Stunning Maangtikka",
            "infotext": "<p>Indian wedding jewelry Maangtikka has always been a quintessential piece, adding a touch of sophistication to the overall look. However, it is often believed that it has to be accompanied by other accessories for a finished look. Our celebrities are breaking this stereotype by effortlessly pulling off a minimal yet impactful look by only choosing Maangtikka over other Indian wedding accessories. The beauty of wearing only a Maangtikka as jewelry is that it allows your outfit to shine through while still making a statement.<\/p><p>Alia Bhatt served as an inspirational example of this minimalist look when she attended a wedding, putting all other Indian wedding jewelry aside and choosing a big Maangtikka with a detailed work of diamonds and colorful beads. She wore a saree with a shimmery blouse and kept her hair open and parted in the middle. With the focus on her hair accessory, the star opted out of wearing earrings as well and kept the look low-key and refreshing. It not only accentuated her face but also made her look effortlessly beautiful. Alia Bhatt's look proved that sometimes, less is indeed more!<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Alia_Bhatt_Maangtikka.png",
            "mobileimage": "shopify:\/\/shop_images\/Alia_Bhatt_Maangtikka.png",
            "imagetext": "<p><em>Image courtesy: Alia Bhatt via Instagram<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Head Over Heels: Heavy Accessories Look",
            "infotext": "<p>When it comes to Indian wedding jewelry, it's hard to deny the mesmerizing charm that comes with wearing all the accessories together. The grandeur and elegance it exudes are non-debatable. From a Maangtikka to an anklet, one can create a beautiful look by putting them all together, and each piece brings its own charm to the table. Our celebrities have often shown us many ways we can rock a look while wearing heavy accessories.<\/p><p>Sonam Kapoor's look at her sister's wedding was a perfect example of how all Indian wedding jewelry pieces can come together beautifully. Wearing a choker necklace, big studs, Payal, and Maangtikka on an Anarkali dress, she created a beautiful look by putting together gold jewelry studded with stones, pearls, and diamonds. The star of the show was, of course, the big round Maangtikka, which looked like a flower and had pearls hanging below. The ensemble was a stunning portrayal of how all the accessories can complement each other and create a cohesive look.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Sonam_Kapoor_Heavily_Accessorised_Look.png",
            "mobileimage": "shopify:\/\/shop_images\/Sonam_Kapoor_Heavily_Accessorised_Look.png",
            "imagetext": "<p><em>Image courtesy: Sonam Kapoor via Instagram<\/em><\/p>"
          }
        },
        "f766075a-ceca-4a31-a983-39f2d4c90eed": {
          "type": "information",
          "settings": {
            "image_on_left": true,
            "headingtext": "Jeweled Hands: Elegance of the Hathphool",
            "infotext": "<p>Again serving us with a twist on minimalism, Alia Bhatt introduced Hathphool to the list of Indian wedding accessories for guests. She again gave an impressive example of creating a beautiful look using minimal jewelry. At a friend’s wedding, she went with a traditional blue saree look, tying her hair in a ponytail, and chose to keep it simple and elegant with just a Maangtikka, a choker necklace, and a Hathphool. Her Indian wedding jewelry was made of gold and decorated with diamonds and pearls. The combination of blue with the shine of diamonds gave her a minimal yet stunning look. The simplicity of her accessories perfectly complemented her attire, creating a serene and refreshing look.<\/p><p>Indian wedding jewelry is an essential element of any wedding look, and celebrities have set some amazing examples with their minimalistic and heavy accessory choices. From Alia Bhatt's serene and simple look to Sonam Kapoor's all-accessories ensemble, there is something for everyone. Take inspiration from these celebrities and add your own personal touch to create a unique and beautiful look. <\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Alia_Bhatt_Hathphool.png",
            "mobileimage": "shopify:\/\/shop_images\/Alia_Bhatt_Hathphool.png",
            "imagetext": "<p><em>Image courtesy: Pinterest<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2",
        "f766075a-ceca-4a31-a983-39f2d4c90eed"
      ],
      "settings": {
        "mainheadingtext": ""
      }
    },
    "406c6c27-8d09-488d-bdb4-d9c735188d09": {
      "type": "article-image-texts-block-new",
      "blocks": {
        "template--16729005752572__406c6c27-8d09-488d-bdb4-d9c735188d09-1685469184ed96f8ee-1": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Looking for the right place to buy Indian wedding jewelry for bridesmaids or guests? Well, look no further. Our exquisite Indian wedding jewelry collection with a wide range of beautiful pieces will complement your style, making sure you shine like a star.<\/p>"
          }
        }
      },
      "block_order": [
        "template--16729005752572__406c6c27-8d09-488d-bdb4-d9c735188d09-1685469184ed96f8ee-1"
      ],
      "settings": {
      }
    },
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db": {
      "type": "article-latest-blog-posts-new",
      "settings": {
        "title": "Read more from our <span>journal<\/span>",
        "post_limit": 15,
        "blog_show_tags": false,
        "blog_show_date": false,
        "blog_show_comments": false,
        "blog_show_author": false,
        "blog_show_excerpt": true,
        "blog_image_size": "square"
      }
    },
    "522c486f-3c38-46df-9c27-be00415ecf72": {
      "type": "Index-featured-collection-new",
      "settings": {
        "backcolor": "#f6f2f1",
        "customClass": "blog_featured_collection_new",
        "title": "You may want to <span>shop<\/span>",
        "home_featured_products": "collectibles",
        "per_row": 4,
        "rows": 1,
        "mobile_scrollable": false,
        "view_all": true
      }
    },
    "1683210261162571d3": {
      "type": "apps",
      "blocks": {
        "3a09b2ef-849a-4b87-9534-e9cc65ede753": {
          "type": "shopify:\/\/apps\/time2read-read-time-estimator\/blocks\/app-block-article-read-time\/de876115-09d1-4e2f-bd5b-ce94430501cb",
          "settings": {
            "read_time_prefix": "",
            "read_time_suffix": "Minute",
            "read_time_text_color": "#000000",
            "read_time_top_padding": 0,
            "read_time_bottom_padding": 0,
            "read_time_font_size": 16,
            "read_time_bold": false,
            "horizontal_alignment": "unset",
            "read_time_placement": "after",
            "read_time_custom_selector": ".read_placement"
          }
        }
      },
      "block_order": [
        "3a09b2ef-849a-4b87-9534-e9cc65ede753"
      ],
      "settings": {
        "full_width": false,
        "space_around": true
      }
    }
  },
  "order": [
    "main",
    "4af74115-0fc0-45bb-95b8-112a26212284",
    "296f3653-d119-44ea-a190-7cc4b4096411",
    "406c6c27-8d09-488d-bdb4-d9c735188d09",
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db",
    "522c486f-3c38-46df-9c27-be00415ecf72",
    "1683210261162571d3"
  ]
}