{
  "sections": {
    "main": {
      "type": "article-template",
      "blocks": {
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Wedding bells are ringing, love is in the air, and the joyous occasion of marriage beckons us to celebrate with fervor. But wait, there's a twist in the tale! In recent years, a new trend has emerged among Indian couples that has completely redefined the traditional wedding landscape: destination weddings. These grand celebrations are not just about exchanging vows; they are about creating unforgettable memories against breathtaking backdrops. From sun-kissed beaches to majestic palaces, destination weddings offer a blend of romance and adventure like no other. However, amidst this change in scenery, it's worth considering the practicality and style factors that come into play when choosing the perfect <strong>Indian wedding jewelry.<\/strong> Embracing this idea opens up a world of possibilities.<\/p><p><\/p>"
          }
        },
        "19618fbd-be7d-4855-8552-2a7b248b88b4": {
          "type": "heading",
          "settings": {
            "headingtext": "<p><strong>Indian Wedding Jewelry Selection for Destination Weddings<\/strong>—A Journey of Elegance and Adventure <\/p>"
          }
        },
        "25d8d700-9ec9-4126-a00b-41cf572391f7": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/2_ac34409f-f445-4fb8-ac12-6d1f28ce6362.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/2_ac34409f-f445-4fb8-ac12-6d1f28ce6362.jpg",
            "smallinfotext": "<p><em>Image courtesy: Stories by Joseph Radhik<\/em><\/p>"
          }
        },
        "e64625cd-b163-4634-bf5f-ee83676a29f3": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Specifically chosen for the occasion, jewelry adds a touch of glamor and elegance to the overall wedding experience. Indian wedding jewelry has been an integral part of the wedding celebrations for centuries. Each piece becomes a cherished memento, representing the love, joy, and celebration of the wedding day. The beauty of Indian wedding jewelry lies not only in its aesthetic appeal but also in the emotions and memories it carries. However, the evolving landscape of destination weddings has necessitated a shift in Indian wedding jewelry. <\/p><p>In the context of destination weddings, Indian wedding jewelry has adapted to meet the requirements of the modern bride and groom. Lighter, more versatile pieces that complement the destination wedding theme have become a part of <strong>traditional Indian wedding jewelry.<\/strong> If you are planning to have a destination wedding and looking for elegant and stylish ways to accessorize yourself, you’ve come to the right place.<\/p><p>Today, we will delve into the world of Indian wedding jewelry for destination weddings, exploring the various practical and stylish choices that will add a touch of elegance to your special day. So get ready to embark on a journey of timeless beauty and exquisite craftsmanship that perfectly complements your destination wedding dreams.<\/p>"
          }
        }
      },
      "block_order": [
        "9ee21dfa-959b-4956-b17f-0ade92e3cdc2",
        "19618fbd-be7d-4855-8552-2a7b248b88b4",
        "25d8d700-9ec9-4126-a00b-41cf572391f7",
        "e64625cd-b163-4634-bf5f-ee83676a29f3"
      ],
      "settings": {
        "image_hero": true,
        "blog_show_tags": false,
        "blog_show_date": true,
        "blog_show_comments": false,
        "blog_show_author": false,
        "social_sharing_blog": true
      }
    },
    "296f3653-d119-44ea-a190-7cc4b4096411": {
      "type": "article-images-with-texts-new",
      "blocks": {
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Rolling mill to achieve a length of thin ribbon",
            "infotext": "<p>Kundan is unmixed gold that is beaten in lengths to form a flat strip. The strips are rolled up around a small flat iron bar (10 cm long and 2.5 cm wide) and worked until each wire overlaps and joins the other after some preparation (heating, cooling, washing, and drying). The end result is pure gold foil, free of any alloying metal.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1": {
          "type": "information",
          "settings": {
            "image_on_left": true,
            "headingtext": "Kundan ribbons ready for use",
            "infotext": "<p>After folding multiple times, the Kundan ribbon (ranging in thickness from 4mm to 7mm) is ready to be divided into small pieces and used. It must be handled with extreme caution and must not be touched by hand to prevent impurities from mixing with the metal. According to goldsmiths, the ability to create high-quality Kundan is the first and most important virtue of their trade.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        },
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2": {
          "type": "information",
          "settings": {
            "image_on_left": false,
            "headingtext": "Different shapes put together",
            "infotext": "<p>The sophisticated Kundan technique enables gemstones of any size or shape to be set into intricate designs. Sometimes, before the entire stone-setting process begins, gold-smiths might fill the hollow frame, known as ghat, with different objects of varying shapes grouped together to form the object. Another option is to let the shape of the gemstone define the ghat's shame.<\/p><p>Since earlier times, certain shapes have influenced the jewelry-making tradition. Squares, triangles, and circles are the most common shapes.<\/p>",
            "desktopimage": "shopify:\/\/shop_images\/Rectangle_6084_1_-min.jpg",
            "mobileimage": "shopify:\/\/shop_images\/Rectangle_6086-min.jpg",
            "imagetext": "<p><em>Source and Image courtesy: Traditional Indian Jewellery—Beautiful People by Bernadette Van Gelder<\/em><\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-0",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-1",
        "template--16686221689084__296f3653-d119-44ea-a190-7cc4b4096411-16795551294d9b5405-2"
      ],
      "disabled": true,
      "settings": {
        "mainheadingtext": "The intricate art of kundan jewelry<br> making- a closer look!"
      }
    },
    "4af74115-0fc0-45bb-95b8-112a26212284": {
      "type": "article-image-texts-block-new",
      "blocks": {
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Planning Your Dream Destination Indian Wedding Jewelry: Key Factors to Consider<\/p>"
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/3_e1f6890c-e81a-49f0-8525-77b14d4fd2d5.png",
            "mainmobileimage": "shopify:\/\/shop_images\/3_e1f6890c-e81a-49f0-8525-77b14d4fd2d5.png",
            "smallinfotext": ""
          }
        },
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When planning a destination wedding, there are several factors to consider when selecting the perfect Indian wedding jewelry for your big day. Two key aspects to keep in mind are the climate and location of your wedding. The climate plays a significant role in determining the type of jewelry that will be suitable and comfortable to wear. For instance, if you're having a wedding in a hot and humid destination or on a beach, you may want to opt for lightweight and breathable jewelry that won't feel heavy or cause discomfort in the heat.<\/p><p>Another crucial consideration in choosing Indian wedding jewelry is its ability to withstand different weather conditions. If you're expecting rain or high humidity, it's advisable to select jewelry made from materials that are resistant to tarnishing, such as platinum or stainless steel. Additionally, considering jewelry with secure clasps and settings can prevent any accidental damage or loss.<\/p>"
          }
        },
        "74220eed-5a45-4a4b-9e01-453e3e4dcc75": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/4_3eb61799-f235-45a7-9e3a-c86830afdd77.png",
            "mainmobileimage": "shopify:\/\/shop_images\/4_3eb61799-f235-45a7-9e3a-c86830afdd77.png",
            "smallinfotext": "<p><em>Vasundhara Earrings<\/em><\/p>"
          }
        },
        "fd881edf-a245-42ec-8834-b79abeae9c1a": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When traveling for a destination wedding, it's important to choose Indian wedding jewelry that is travel-friendly. Opting for compact and sturdy pieces will make transportation easier and reduce the risk of damage. Consider jewelry that can be easily stored and won't take up much space in your luggage. Pieces like stud earrings, pendant necklaces, or delicate bracelets can be versatile options that can complement various outfits without taking up too much room.<\/p><p>By taking into account the climate, location, and travel-friendly aspects of your destination wedding, you can select the perfect jewelry that will not only enhance your bridal look but also withstand the conditions and make your special day even more memorable. Confused about which jewelry pieces to choose for your destination wedding? Read along for tips to help you make the right decisions!<\/p><p><\/p>"
          }
        },
        "00d38736-4ce2-430f-86bc-a0ee3df50c9b": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Choices for Destination Indian Wedding Jewelry<\/p>"
          }
        },
        "34397066-86a6-496c-a820-0aaa53228200": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/5_7e1fcedb-a852-45ab-999e-0352827751b1.png",
            "mainmobileimage": "shopify:\/\/shop_images\/5_7e1fcedb-a852-45ab-999e-0352827751b1.png",
            "smallinfotext": "<p><em>Abha and Kanha Necklaces by Aurus<\/em><\/p>"
          }
        },
        "b01acd28-8805-42f2-a5c2-d8bd4cfba809": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When it comes to destination weddings, choosing the right jewelry is essential to complete the bridal ensemble. Opting for versatile pieces that can be easily styled for various wedding events and outfits is a smart choice. Such jewelry ensures that you can make the most out of your investment and wear it beyond the wedding day. <\/p><p>Additionally, selecting gemstones that complement the destination wedding themes and colors can add a unique touch to your jewelry. For instance, turquoise, aquamarine, and citrine are popular choices for beach destination weddings due to their vibrant and soothing hues. These gemstones can enhance the overall ambiance and aesthetics of your wedding.<\/p><p>For those who want to infuse a hint of tradition into their destination wedding jewelry, incorporating elements from Indian designs can create a beautiful fusion. Motifs like peacocks, lotus, or paisley can be incorporated in a subtle yet significant manner, giving a nod to Indian culture while maintaining a contemporary appeal. Such fusion designs can be a perfect representation of the bride's heritage while embracing the destination's charm.<\/p><p>Choosing the right Indian wedding jewelry for a destination wedding involves considering versatility, gemstone selection, and fusion design elements. By carefully selecting these elements, brides can ensure that their jewelry not only complements their destination wedding but also becomes a cherished keepsake for years to come. However, these cherished articles need to be taken care of. Here are a few tips on how to take care of destination Indian wedding jewelry.<\/p>"
          }
        },
        "898dbe31-f12d-46ef-8fe3-9a00176f22c6": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/6_d50c210c-df66-45be-84ec-08eefd81086d.png",
            "mainmobileimage": "shopify:\/\/shop_images\/6_d50c210c-df66-45be-84ec-08eefd81086d.png",
            "smallinfotext": "<p><em>Chaitanya Earrings by Aurus<\/em><\/p>"
          }
        },
        "173e9f82-3195-4c32-bced-1bc785d7e033": {
          "type": "heading",
          "settings": {
            "headingtext": "<p>Tips for Jewelry Care during Destination Weddings<\/p>"
          }
        },
        "8bea0128-6bfe-474f-9854-37f730885ca9": {
          "type": "heading",
          "settings": {
            "headingtext": "<h3>Secure Storage<\/h3>"
          }
        },
        "b9eeb4f7-34f8-4f52-ad36-a584333fd5d7": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>When traveling for a destination wedding, it's essential to have a secure storage option for your Indian wedding jewelry. Consider using a travel jewelry case or a small pouch with separate compartments to keep each piece organized and prevent them from tangling or scratching each other.<br\/>When traveling for a destination wedding, it's essential to have a secure storage option for your Indian wedding jewelry. Consider using a travel jewelry case or a small pouch with separate compartments to keep each piece organized and prevent them from tangling or scratching each other.<\/p>"
          }
        },
        "bfc674c5-9804-473d-8939-bd35f00f4839": {
          "type": "heading",
          "settings": {
            "headingtext": "<h3>Carry-On Only<\/h3>"
          }
        },
        "6bf4b957-3669-48d6-b227-097d974192e9": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Avoid checking in your Indian wedding jewelry with your luggage. Instead, keep it with you in your carry-on bag to minimize the risk of loss or theft. This way, you can also ensure that your jewelry is protected from rough handling during baggage inspections.<\/p>"
          }
        },
        "538a723f-2d1b-415b-94c3-42cf9764fb85": {
          "type": "heading",
          "settings": {
            "headingtext": "<h3>Avoid Excessive Heat and Moisture<\/h3>"
          }
        },
        "3880d28e-6e64-4520-9693-09003b5c2425": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Extreme temperatures and moisture can damage your Indian wedding jewelry. Keep it away from direct sunlight, as excessive heat can cause gemstones and metals to fade or warp. Avoid wearing jewelry when swimming or participating in water activities to prevent damage from chlorine or saltwater.<\/p>"
          }
        },
        "ed2a0f14-054f-47dc-8dfb-d33883b3ba8b": {
          "type": "heading",
          "settings": {
            "headingtext": "<h3>Gentle Cleaning<\/h3>"
          }
        },
        "5adb01df-1f8c-4575-b04e-fef4cc53c0dd": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>To keep your Indian wedding jewelry looking its best, gently clean it after each use. Use a soft, lint-free cloth to remove any dirt or oils. Avoid using harsh chemicals or abrasive materials, as they can scratch or tarnish your jewelry.<\/p>"
          }
        },
        "3a2ae97b-1ced-4f72-a4f6-c13b924d541e": {
          "type": "heading",
          "settings": {
            "headingtext": "<h3>Safekeeping during Activities<\/h3>"
          }
        },
        "aa7cdde1-d887-41c3-beaf-2fc465ffcd26": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>During wedding activities like dancing or sports, it's advisable to remove delicate or expensive Indian wedding jewelry. Store them securely in your room or a designated safe place. Opt for more durable and less valuable pieces that can withstand the wear and tear of such activities.<\/p>"
          }
        },
        "e3327eaf-a8f5-47bb-a104-2a38c16c5907": {
          "type": "images",
          "settings": {
            "maindesktopimage": "shopify:\/\/shop_images\/7_9b116579-1579-4694-8d0c-24529a3d91d5.jpg",
            "mainmobileimage": "shopify:\/\/shop_images\/7_9b116579-1579-4694-8d0c-24529a3d91d5.jpg",
            "smallinfotext": "<p><em>Image courtesy: Pexels<\/em><\/p>"
          }
        },
        "5f59f980-ef28-41fb-9418-d935cbb0beff": {
          "type": "texts",
          "settings": {
            "fullinfotext": "<p>Choosing the right Indian wedding jewelry for a destination wedding is not only a matter of style but also practicality. The perfect pieces can enhance your bridal look while withstanding the challenges that come with a destination wedding. Whether you opt for lightweight and versatile options like delicate necklaces and bracelets or go for statement pieces that reflect culture, there are endless possibilities to make your Indian wedding jewelry both practical and stylish.<\/p><p>Ultimately, the key is to strike a balance between practicality and style. Choose Indian wedding jewelry pieces that not only complement your wedding dress but also suit the destination's atmosphere and your personal taste. Take the time to research and try out different options before making a final decision. By selecting jewelry that is both practical and stylish, you'll feel confident and beautiful throughout your destination wedding, creating memories that will last a lifetime.<\/p>"
          }
        }
      },
      "block_order": [
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-0",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-2",
        "template--16686221689084__4af74115-0fc0-45bb-95b8-112a26212284-167949909336053620-1",
        "74220eed-5a45-4a4b-9e01-453e3e4dcc75",
        "fd881edf-a245-42ec-8834-b79abeae9c1a",
        "00d38736-4ce2-430f-86bc-a0ee3df50c9b",
        "34397066-86a6-496c-a820-0aaa53228200",
        "b01acd28-8805-42f2-a5c2-d8bd4cfba809",
        "898dbe31-f12d-46ef-8fe3-9a00176f22c6",
        "173e9f82-3195-4c32-bced-1bc785d7e033",
        "8bea0128-6bfe-474f-9854-37f730885ca9",
        "b9eeb4f7-34f8-4f52-ad36-a584333fd5d7",
        "bfc674c5-9804-473d-8939-bd35f00f4839",
        "6bf4b957-3669-48d6-b227-097d974192e9",
        "538a723f-2d1b-415b-94c3-42cf9764fb85",
        "3880d28e-6e64-4520-9693-09003b5c2425",
        "ed2a0f14-054f-47dc-8dfb-d33883b3ba8b",
        "5adb01df-1f8c-4575-b04e-fef4cc53c0dd",
        "3a2ae97b-1ced-4f72-a4f6-c13b924d541e",
        "aa7cdde1-d887-41c3-beaf-2fc465ffcd26",
        "e3327eaf-a8f5-47bb-a104-2a38c16c5907",
        "5f59f980-ef28-41fb-9418-d935cbb0beff"
      ],
      "settings": {
      }
    },
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db": {
      "type": "article-latest-blog-posts-new",
      "settings": {
        "title": "Read more from our <span>journal<\/span>",
        "post_limit": 15,
        "blog_show_tags": false,
        "blog_show_date": false,
        "blog_show_comments": false,
        "blog_show_author": false,
        "blog_show_excerpt": true,
        "blog_image_size": "square"
      }
    },
    "522c486f-3c38-46df-9c27-be00415ecf72": {
      "type": "Index-featured-collection-new",
      "settings": {
        "backcolor": "#f6f2f1",
        "customClass": "blog_featured_collection_new",
        "title": "You may want to <span>shop<\/span>",
        "home_featured_products": "collectibles",
        "per_row": 4,
        "rows": 1,
        "mobile_scrollable": false,
        "view_all": true
      }
    },
    "1683210261162571d3": {
      "type": "apps",
      "settings": {
        "full_width": false,
        "space_around": true
      }
    }
  },
  "order": [
    "main",
    "296f3653-d119-44ea-a190-7cc4b4096411",
    "4af74115-0fc0-45bb-95b8-112a26212284",
    "1a2e8dff-c407-4ec0-b2b6-26e7b1dba2db",
    "522c486f-3c38-46df-9c27-be00415ecf72",
    "1683210261162571d3"
  ]
}